// Завдання 1:

// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().
// =====================================================//
// const number = Number(prompt('Enter number'));

// -------------option 1------------------- //
// if (number === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

// -------option 2(тернарник)------------- //
// number === 10 ? alert('Вірно') : alert("Невірно");

// ----option 3 (спрощений тернарник)----- //
// alert(number === 10 ? 'Вірно' : 'Невірно');

// =============================================== //

// ----------cамостійна задача-------------- //

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// if (min <= 15) {
//   alert(`${min} входить в першу чверть`);
// } else if (min <= 30) {
//   alert(`${min} входить в другу чверть`);
// } else if (min <= 45) {
//   alert(`${min} входить в третю чверть`);
// } else {
//   alert(`${min} входить в четверту чверть`);
// }

// ===================================================== //
// ---------------задача 3------------------------- //

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// ================================================================== //
// const num = prompt("Введіть значення від 1 до 4");
// let result;
// switch (num) {
//   case "1":
//     result = "зима";
//     break;
//   case "2":
//     result = "весна";
//     break;
//   case "3":
//     result = "літо";
//     break;
//   case "4":
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
// }
// console.log(result);
// =================================================== //

// задача 9

// Напишіть функцію isAdult(age), яка  приймає число - вік користувача і повертає true,
// якщо параметр age більше чи дорівнює 18.
// В іншому випадку вона запитує підтвердження через confirm
// і повертає його результат (true/false).

// ========================================================================= //
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// -------------option 1------------------- //

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     const checkAge = confirm('Are you adult?');
//     return checkAge;
//   }
// }

// console.log(isAdult(17));

// -------------option 2------------------- //

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   } else {
//     // можемо прибрати це  // const checkAge = .... return checkAge; // і додати confirm('Are you adult?');
//     return confirm("Are you adult?");
//   }
// }

// console.log(isAdult(17));

// -------------option 3------------------- //

// function isAdult(age) {
//   if (age >= 18) {
//     return true;
//   }
//   return confirm("Are you adult?");
// }

// console.log(isAdult(17));

// -------------option 4 тернарник------------------- //

// function isAdult(age) {
//   return age >= 18 ? true: confirm("Are you adult?");
// }

// console.log(isAdult(17));

// -------------option 5 || (або)------------------- //

// function isAdult(age) {
//   return age >= 18 || confirm("Are you adult?");
// }

// console.log(isAdult(17));

// =========================================================//

// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//   if (typeof a === "number" && typeof b === "number") {
//     if (a > b) {
//       return b;
//     } else {
//       return a;
//      }
//   } else {
//     return "Not a number"
//    }
// }
// console.log(min(13, 7));

// console.log(min(21, 24));

// megalong ineffective and irritating code))) //

// ================  !== і тернарник  ==========================//

// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number"
//   }
//   return a > b ? b : a;
// }

// console.log(min(13, 7));

// console.log(min(21, 24));

// console.log(min(0, 1));

// =============== Math.min(a, b) ======================== //

// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") {
//     return "Not a number"
//   }
//   return Math.min(a, b);
// }

// console.log(min(13, 23));

// console.log(min(5, 24));

// console.log(min(7, 98));

// ================ shortest version || + ternar ==================== //

// function min(a, b) {
//   return (typeof a !== "number" || typeof b !== "number") ? "Not a number" : Math.min(a, b);
// }

// console.log(min(13, 23));

// console.log(min(5, 24));

// console.log(min("7", 98));

// ==================================================================//

// 7

// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }

// console.log(getNumbers(23, 40));

// ============================================== //

// Завдання 6:

// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let count = 0;
// while (count <= 20) {
//   console.log(count);
//   count += 1;
// }

// ==================================================== //

//Завдання 10:

// Напишіть функцію fizzBuzz(num), яка приймає число і перевіряє кожне число від 1 до num:
// Якщо число ділитися  без остачі на 3 - виводить в консоль 'fizz',
// якщо ділиться  без остачі на 5 - виводить в консоль 'buzz',
// якщо ділиться  без остачі і на 3, і на 5 - виводить в консоль 'fizzbuzz'.

// 
// =====================================================================

function fizzBuzz(num) {
  for (let i = 1; i <= num; i++) {
    if (i % 3 === 0 && i % 5 === 0) {
      console.log("fizzBuzz");
    } else if (i % 3 === 0) {
      console.log("fizz");
    } else if (i % 5 === 0) {
      console.log("buzz");
    } else {
      console.log(i);
    }
  }
}

fizzBuzz(15);
